'''
#输出一行星星
i = 0
while i < 10:
    print('*',end = '')
    i += 1
'''

'''
#输出10行10列的星星
#循环生成10行
j = 0
while j < 10:
    #输出一行星星
    i = 0
    while i < 10:
        print('*', end='')
        i += 1
    #输出一个换行
    print()
    #变量自增
    j += 1
'''

#将输出10行10列的星星作为一个整体

def mystar():#新的代码组  函数
    j = 0
    while j < 3:
        # 输出一行星星
        i = 0
        while i < 10:
            print('*', end='')
            i += 1
        # 输出一个换行
        print()
        # 变量自增
        j += 1

#在输出1个10行10列的星星
mystar()

print('---------------------')
#在输出1个10行10列的星星
mystar()
#在输出1个5行5列的星星




